#+STARTUP:    align showall nodlcheck showstars oddeven lognotestate hideblocks

** Cota inferior de Cramér-Rao 

#+NAME: fisher_information_function
#+BEGIN_SRC octave :exports none :tangle ../octave/statistics/fisher_information.m :noweb yes :padline no
  function FI=fisher_information(PROB,THETA)
    <<octave-license-dz>>
    ## usage: FI=fisher_information(PROB,THETA)
    ## Author: Javier Eduardo Diaz Zamboni <javierdiaz@bioingenieria.edu.ar>
    ## Version: 0.2
    ## Keywords: Fisher information
    log_prob_deriv2=@(theta)df2x2(@(theta2)log(PROB(theta2)),theta,0);
    FI=-1.0*sum(log_prob_deriv2(THETA)(:).*PROB(THETA)(:));
  endfunction
#+END_SRC

The following function is deprecated.

#+NAME: cramer_rao_bound_for_poisson_function
#+BEGIN_SRC octave :exports none :noweb yes :padline no :tangle ../octave/statistics/cr_bound_poisson.m
function CRLB=cr_bound_poisson(MODEL,THETA)
      <<octave-license-dz>>
      ## usage: CRB=crlb_poisson(MODEL,THETA)
      ## Author: Javier Eduardo Diaz Zamboni <javierdiaz@bioingenieria.edu.ar>
      ## Version: 0.2
      ## Keywords: Cramer Rao Lower Bound (variance) for poisson distrubuited data 
      CRLB=crlb_poisson(MODEL,THETA);
  endfunction
#+END_SRC


This is the new function to evaluate the Cramér-Rao lower bound for poisson data.

#+NAME: cramer_rao_bound_for_poisson_function
#+BEGIN_SRC octave :exports none :noweb yes :padline no :tangle ../octave/statistics/crlb_poisson.m
function CRLB=crlb_poisson(MODEL,THETA)
      <<octave-license-dz>>
      ## usage: CRB=crlb_poisson(MODEL,THETA)
      ## Author: Javier Eduardo Diaz Zamboni <javierdiaz@bioingenieria.edu.ar>
      ## Version: 0.1
      ## Keywords: Cramer Rao Lower Bound (variance) for poisson distributed data 
      deriv_sq=dfx(MODEL,THETA,0,1e-10).^2;
      CRLB=1/sum(deriv_sq(:)./MODEL(THETA)(:));
  endfunction
#+END_SRC

#+NAME: test_cr_bound
#+BEGIN_SRC octave :results output :exports none :noweb yes :padline no
  <<octave-license-dz>>
  clear all;  more off;
  <<gl-model-setup>>
  m.n_col=19;
  m.n_row=19;
  peak_shift=-1;
  t_s=5;
  photons_at_plane=2.^[8 10 12 14 16]; 
  background=0;
  sd_ro_noise=0;
  for k=1:1
    m.n_lay=k;
    m.image_formation = @(T_S,NORM)generate_image_stack(@(XX,YY,ZZ)m.gl_psf_punctual(XX,YY,ZZ,T_S),...
                                                        m.pixel_size,m.pixel_size,m.delta_z,...
                                                        m.n_col,m.n_row,m.n_lay,NORM,peak_shift);
    for j=1:length(photons_at_plane)  
      disp(strcat("AGUET:\t",num2str(sqrt(1/cr_bound_poisson(@(T_S)m.image_formation(T_S,"none")*photons_at_plane(j)+background+sd_ro_noise^2,t_s)))))
          ##var_crb(pap_counter,1)=1/fisher_information(@(T_S)convert_to_pmf(@(PARAM)m.image_formation(PARAM,"none")*test.photons_at_plane(pap_counter),T_S),test.t_s);
	  ##disp(strcat("FISHER:\t",num2str(sqrt(1/fisher_information(@(T_S)m.image_formation(T_S,"none")*photons_at_plane(j)+background+sd_ro_noise^2,t_s)))))
      disp(strcat("FISHER:\t",num2str(sqrt(1/(fisher_information(@(T_S)convert_to_pmf(@(PARAM)m.image_formation(PARAM,"none")*photons_at_plane(j)+background+sd_ro_noise^2,T_S),t_s))))))
    endfor
  endfor

  m.n_col=1;
  m.n_row=19;
  m.n_lay=45;
  peak_shift=0;
  t_s=5;
  background=0;
  sd_ro_noise=0;
  m.image_formation = @(T_S,NORM)generate_image_stack(@(XX,YY,ZZ)m.gl_psf_punctual(XX,YY,ZZ,T_S),...
                                                        m.pixel_size,m.pixel_size,m.delta_z,...
                                                        m.n_col,m.n_row,m.n_lay,NORM,peak_shift);
for j=1:length(photons_at_plane) 
    disp(strcat("AGUET sagittal cut:\t",num2str(sqrt(1/cr_bound_poisson(@(T_S)m.image_formation(T_S,"none")*photons_at_plane(j)+background+sd_ro_noise^2,t_s)))))
    disp(strcat("FISHER for sagittal cut:\t",num2str(sqrt(1/fisher_information(@(T_S)m.image_formation(T_S,"none")*photons_at_plane(j)+background+sd_ro_noise^2,t_s)))))
endfor

 #+END_SRC
   
#+RESULTS: test_cr_bound
#+begin_example
AGUET:	0.17082
FISHER:	5.1117
AGUET:	0.085408
FISHER:	5.1117
AGUET:	0.042704
FISHER:	5.1117
AGUET:	0.021352
FISHER:	5.1117
AGUET:	0.010676
FISHER:	5.1117
AGUET sagittal cut:	0.033048
FISHER for sagittal cut:	0.042762
AGUET sagittal cut:	0.016524
FISHER for sagittal cut:	0.021381
AGUET sagittal cut:	0.008262
FISHER for sagittal cut:	0.01069
AGUET sagittal cut:	0.004131
FISHER for sagittal cut:	0.0053452
AGUET sagittal cut:	0.0020655
FISHER for sagittal cut:	0.0026726
#+end_example

** Estimador de Bootstrap no paramétrico
#+NAME: nonparametric_bootstrap_statistic_function
#+BEGIN_SRC octave :exports none :tangle ../octave/statistics/nonparametric_bootstrap_statistics.m
  function [THETA SE CI]=nonparametric_bootstrap_statistics(DATA,STATISTIC,B,ALPHA)
    ## usage: [THETA SE CI]=nonparametric_bootstrap_statistics(DATA,STATISTIC,B,ALPHA)
    narginchk(4,4)

    THETA=STATISTIC(DATA);
    data_dim=size(DATA);
    sample_number=length(DATA);
    theta_boot=zeros(B,1);
    se_aux=zeros(B,1);
    ## sampling with replacement
    for b=1:B
      data_boot=DATA(unidrnd(sample_number,data_dim));
      theta_boot(b)=STATISTIC(data_boot);     
      se_aux(b)=(theta_boot(b)-THETA).^2;
    endfor
    CI=quantile(theta_boot,[ALPHA 1-ALPHA])';
    SE=sqrt(mean(se_aux));

  endfunction

#+END_SRC
   
#+NAME: nonparametric_bootstrap_statistic_function_test
#+BEGIN_SRC octave :results output :exports none
  N=10;
  B=10000;
  alpha=0.05;
  mu=5;
  sigma=2;
  x=normrnd(mu,sigma,N,1);
  disp("--------------------")
  disp("Results for mean")
  [MEAN SE CI]=nonparametric_bootstrap_statistics(x,@mean,B,alpha)
  disp("--------------------")
  disp("Results for std")
  [STD SE CI]=nonparametric_bootstrap_statistics(x,@std,B,alpha)
#+END_SRC

#+RESULTS: nonparametric_bootstrap_statistic_function_test
#+begin_example
--------------------
Results for mean
MEAN =  4.7890
SE =  0.60376
CI =

   3.7397   5.7260

--------------------
Results for std
STD =  2.0359
SE =  0.35837
CI =

   1.3266   2.3959


#+end_example

